In [25]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import re

In [112]:
df = pd.read_csv('../data/titanic.csv', index_col='PassengerId')

In [113]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [114]:
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [115]:
df.Survived.value_counts(normalize=True)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [116]:
df.Pclass.value_counts(normalize=True)

3    0.551066
1    0.242424
2    0.206510
Name: Pclass, dtype: float64

In [117]:
df.Age.mean(), df.Age.median()

(29.69911764705882, 28.0)

In [118]:
df.corr()

          Survived    Pclass       Age     SibSp     Parch      Fare
Survived  1.000000 -0.338481 -0.077221 -0.035322  0.081629  0.257307
Pclass   -0.338481  1.000000 -0.369226  0.083081  0.018443 -0.549500
Age      -0.077221 -0.369226  1.000000 -0.308247 -0.189119  0.096067
SibSp    -0.035322  0.083081 -0.308247  1.000000  0.414838  0.159651
Parch     0.081629  0.018443 -0.189119  0.414838  1.000000  0.216225
Fare      0.257307 -0.549500  0.096067  0.159651  0.216225  1.000000

In [143]:
female_names = df[df.Sex == 'female'].Name

In [144]:
female_names

PassengerId
2      Cumings, Mrs. John Bradley (Florence Briggs Th...
3                                 Heikkinen, Miss. Laina
4           Futrelle, Mrs. Jacques Heath (Lily May Peel)
9      Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
10                   Nasser, Mrs. Nicholas (Adele Achem)
                             ...
881         Shelley, Mrs. William (Imanita Parrish Hall)
883                         Dahlberg, Miss. Gerda Ulrika
886                 Rice, Mrs. William (Margaret Norton)
888                         Graham, Miss. Margaret Edith
889             Johnston, Miss. Catherine Helen "Carrie"
Name: Name, Length: 314, dtype: object

In [170]:
def get_popular_names(names):
    names = ' '.join(list(names))
    single_names = re.split('\\. |, |; | ', names)
    d = {}
    for name in single_names:
        if name in d:
            d[name] += 1
        else:
            d[name] = 1
    d_sorted = sorted(d.items(), key=lambda name: name[1], reverse=True)
    return d_sorted

In [179]:
get_popular_names(df[df.Sex == 'female'].Name)[:10]

[('Miss', 182),
 ('Mrs', 125),
 ('William', 15),
 ('Mary', 13),
 ('Anna', 11),
 ('Elizabeth', 9),
 ('John', 8),
 ('Margaret', 8),
 ('Maria', 7),
 ('Henry', 6)]